# ElementRenamedOnPaste Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..ElementRenamedOnPaste Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
The loaded type "[Name]" has been renamed to "[New Name]" to avoid conflicts with the existing type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementRenamedOnPaste { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementRenamedOnPaste As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementRenamedOnPaste {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace